In [ ]:
# IMPORTAR PAQUETES
import numpy as np
import pandas as pd

1. Convertir el archivo CSV a un DataFrame de pandas y mostrar las primeras filas

In [ ]:


df = pd.read_csv("BikePrices.csv")
df.head()

,Brand,Model,Selling_Price,Year,Seller_Type,Owner,KM_Driven,Ex_Showroom_Price
0,TVS,TVS XL 100,30000,2017,Individual,1st owner,8000,30490.0
1,Bajaj,Bajaj ct 100,18000,2017,Individual,1st owner,35000,32000.0
2,Yo,Yo Style,20000,2011,Individual,1st owner,10000,37675.0
3,Bajaj,Bajaj Discover 100,25000,2010,Individual,1st owner,43000,42859.0
4,Bajaj,Bajaj Discover 100,24999,2012,Individual,2nd owner,35000,42859.0

2. Verifica si hay valores no nulos en cada columna del df

In [ ]:


df.notna().sum()

Brand                1061
Model                1061
Selling_Price        1061
Year                 1061
Seller_Type          1061
Owner                1061
KM_Driven            1061
Ex_Showroom_Price     626
dtype: int64

3. Muestra los faltantes de cada columna

In [ ]:
# 

df.isna().sum()

Brand                  0
Model                  0
Selling_Price          0
Year                   0
Seller_Type            0
Owner                  0
KM_Driven              0
Ex_Showroom_Price    435
dtype: int64

4. Elimina las filas que tienen al menos un faltante

In [ ]:

df.dropna()

,Brand,Model,Selling_Price,Year,Seller_Type,Owner,KM_Driven,Ex_Showroom_Price
0,TVS,TVS XL 100,30000,2017,Individual,1st owner,8000,30490.0
1,Bajaj,Bajaj ct 100,18000,2017,Individual,1st owner,35000,32000.0
2,Yo,Yo Style,20000,2011,Individual,1st owner,10000,37675.0
3,Bajaj,Bajaj Discover 100,25000,2010,Individual,1st owner,43000,42859.0
4,Bajaj,Bajaj Discover 100,24999,2012,Individual,2nd owner,35000,42859.0
...,...,...,...,...,...,...,...,...
621,Harley,Harley-Davidson Street 750,330000,2014,Individual,4th owner,6500,534000.0
622,Kawasaki,Kawasaki Ninja 650 [2018-2019],300000,2011,Individual,1st owner,12000,589000.0
623,Kawasaki,Kawasaki Ninja 650 [2018-2019],425000,2017,Individual,2nd owner,13600,599000.0
624,Suzuki,Suzuki GSX S750,760000,2019,Individual,1st owner,2800,752020.0
625,Harley,Harley-Davidson Street Bob,750000,2013,Individual,2nd owner,12000,1278000.0

5. Muestra filas y columnas luego de eliminar los valores faltantes.

In [8]:
df.dropna().shape

(626, 8)

6. Media por columna para valores solo de numeros

In [13]:
df.mean(numeric_only=True)

Selling_Price        59638.151744
Year                  2013.867107
KM_Driven            34359.833176
Ex_Showroom_Price    87958.714058
dtype: float64

7. Halla el valor maximo de la columna precio de venta

In [ ]:

df['Selling_Price'].max()

np.int64(760000)

8. calcula la diferencia entre la celda donde estoy y la celda anterior

In [15]:
df['Selling_Price'].diff()

0           NaN
1      -12000.0
2        2000.0
3        5000.0
4          -1.0
         ...
1056    -9000.0
1057   -70000.0
1058    40000.0
1059   -20000.0
1060    -5000.0
Name: Selling_Price, Length: 1061, dtype: float64

9. Me devuelve las dos primera letras de la comuna "Brand"

In [ ]:
df['Brand'].str[:4]

0       TV
1       Ba
2       Yo
3       Ba
4       Ba
        ..
1056    Ro
1057    He
1058    Ba
1059    He
1060    He
Name: Brand, Length: 1061, dtype: object

10. Devuelve la suma total de la marca "TVS"

In [ ]:
df['Brand'].str.contains('TVS').sum()

np.int64(69)